---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.SegmentsFittings
source: html/2835f145-7170-ada0-14ab-891001bbea58.htm
---
# Autodesk.Revit.DB.GroupTypeId.SegmentsFittings Property

Segments and Fittings.

## Syntax (C#)
```csharp
public static ForgeTypeId SegmentsFittings { get; }
```